org/2015-02-02-help.org
#+TITLE: Emacsのヘルプ
#+DATE: 2015-02-02
#+SETUPFILE: ../setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: help
#+JEKYLL_PUBLISHED: true

* はじめに
Emacsを触り慣れてない人だと、**がわからないという自体になりがちです。
この記事ではEmacsで困った事態になった際の解決策、もしくは解決に役立つ
だろう方法を記述したいと思います。

* 訳が分からなくなったら
困ったら: 
#+HTML: <h1> <em> C-g </em> </h1> 
何回も押しとけばとりあえず脱出できると思います。

* ヘルプ
** もしも＊＊がわからなくなったら
*** 現在使っているmodeのキーバインドがわからなくなったら
C-h m(describe-mode)を使うと、現在使っているmodeの簡易説明が出てきます。
*** 名前を知っている変数や関数、コマンドが何に使うものかわからなくなったら
describe-{variable, function, command, etc...}というコマンドが用意され
ているため、それを使いドキュメントを表示できます。
*** ＊＊という{変数, 関数, コマンド}がないか
*apropos* コマンドがこのような時に便利です。aproposは全てのLispシンボル(名前
とでも思ってください)と入力されたパターンを照らし合わせ、合ってい
る全ての物を一覧で出してくれます。aproposをよりうまく使うためには、
Emacsの命名法の慣習を知ると良いでしょう。
もしくは、apropos-documentation(ドキュメントも探索対象に入れる)や
apropos-value(変数の値も探索対象に入れる)を使うとより探しやすくなるか
もしれません。
このコマンドを知っているといろんなところで助かります。ほんとに。

* Tips
** describe-*
describe-*というコマンド群は大体何でも説明してくれます。状況にあったも
のを使ってみてください。終わり。

