_posts/2015-02-02-help.html
---
title: "Emacsのヘルプ"
date: 2015-02-02
layout: post
categories: help
published: true
comments: 
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">はじめに</h2>
<div class="outline-text-2" id="text-1">
<p>
Emacsを触り慣れてない人だと、**がわからないという自体になりがちです。
この記事ではEmacsで困った事態になった際の解決策、もしくは解決に役立つ
だろう方法を記述したいと思います。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">訳が分からなくなったら</h2>
<div class="outline-text-2" id="text-2">
<p>
困ったら: 
</p>
<h1> <em> C-g </em> </h1>
<p>
何回も押しとけばとりあえず脱出できると思います。
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">ヘルプ</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">もしも＊＊がわからなくなったら</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1">現在使っているmodeのキーバインドがわからなくなったら</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
C-h m(describe-mode)を使うと、現在使っているmodeの簡易説明が出てきます。
</p>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2">名前を知っている変数や関数、コマンドが何に使うものかわからなくなったら</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
describe-{variable, function, command, etc&#x2026;}というコマンドが用意され
ているため、それを使いドキュメントを表示できます。
</p>
</div>
</div>
<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3">＊＊という{変数, 関数, コマンド}がないか</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
<b>apropos</b> コマンドがこのような時に便利です。aproposは全てのLispシンボル(名前
とでも思ってください)と入力されたパターンを照らし合わせ、合ってい
る全ての物を一覧で出してくれます。aproposをよりうまく使うためには、
Emacsの命名法の慣習を知ると良いでしょう。
もしくは、apropos-documentation(ドキュメントも探索対象に入れる)や
apropos-value(変数の値も探索対象に入れる)を使うとより探しやすくなるか
もしれません。
このコマンドを知っているといろんなところで助かります。ほんとに。
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Tips</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">describe-*</h3>
<div class="outline-text-3" id="text-4-1">
<p>
describe-*というコマンド群は大体何でも説明してくれます。状況にあったも
のを使ってみてください。終わり。
</p>
</div>
</div>
</div>
